Revit 2027 API
DimensionSegment.Suffix Property
The text shown after the segment's value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Suffix { get; set; }
Public Property Suffix As String
	Get
	Set
public:
property String^ Suffix {
	String^ get ();
	void set (String^ value);
}
member Suffix : string with get, set
Property Value
String
See Also
Reference
DimensionSegment Class
Autodesk.Revit.DB Namespace